Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c_type.h
/**************************************************************************//**
 * @file      rtl8195bhp_i2c_type.h
 * @brief
 * @version   V1.00
 * @date      2017-11-1 10:11:11
 *
 * @note
 *
 ******************************************************************************
 *
 * Copyright(c) 2007 - 2017 Realtek Corporation. All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 ******************************************************************************/

#ifndef _RTL8735B_I2C_TYPE_H_
#define _RTL8735B_I2C_TYPE_H_

#ifdef  __cplusplus
extern "C"
{
#endif


/**************************************************************************//**
 * @defgroup I2C_TYPE_CON
 * @brief  I2C Control Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SLV_DIS_1                          7
#define I2C_BIT_SLV_DIS_1                            ((u32)0x00000001 << 7)                              /*!<R/W 1  This bit controls whether I2C has its slave 1 disabled. If this bit is set (slave is disabled), I2C Module functions only as a master and does not perform any action that requires a slave. 0: slave1 is enabled 1: slave1 is disabled */
#define I2C_SHIFT_SLV_DIS                            6
#define I2C_BIT_SLV_DIS                              ((u32)0x00000001 << 6)                              /*!<R/W 1  This bit controls whether I2C has its slave disabled. If this bit is set (slave is disabled), I2C Module functions only as a master and does not perform any action that requires a slave. 0: slave is enabled 1: slave is disabled */
#define I2C_SHIFT_RSTRT_EN                           5
#define I2C_BIT_RSTRT_EN                             ((u32)0x00000001 << 5)                              /*!<R/W 1  Determines whether RESTART conditions may be sent when acting as a master. Some older slaves do not support handling RESTART conditions; however, RESTART conditions are used in several I2C Module operations. 0: disable 1: enable */
#define I2C_SHIFT_MST_10BIT_ADDR                     4
#define I2C_BIT_MST_10BIT_ADDR                       ((u32)0x00000001 << 4)                              /*!<R/W 1  This bit controls whether the I2C Module starts its transfers in 7- or 10-bit addressing mode when acting as a master. 0: 7-bit addressing 1: 10-bit addressing */
#define I2C_SHIFT_SLV_10BIT_ADDR                     3
#define I2C_BIT_SLV_10BIT_ADDR                       ((u32)0x00000001 << 3)                              /*!<R/W 1  When acting as a slave, this bit controls whether the I2C Module responds to 7- or 10-bit addresses. 0: 7-bit addressing. The I2C Module ignores transactions that involve 10-bit addressing; for 7-bit addressing, only the lower 7 bits of the SAR register are compared. 1: 10-bit addressing. The I2C Module responds to only 10-bit addressing transfers that match the full 10 bits of the SAR register. */
#define I2C_SHIFT_SPD                                1
#define I2C_MASK_SPD                                 ((u32)0x00000003 << 1)                              /*!<R/W 0x3  These bits control at which speed the I2C Module operates; its setting is relevant only if one is operating the I2C Module in master mode. 1: standard mode (0 to 100 kbit/s) 2: fast mode (<=400 kbit/s) 3: high speed mode (<=3.4 Mbit/s) */
#define I2C_SHIFT_MST_MOD                            0
#define I2C_BIT_MST_MOD                              ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls whether the I2C Module master is enabled. 0: master disabled 1: master enabled */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_TAR
 * @brief  I2C Target Address Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_TAR_10BIT_ADDR                     12
#define I2C_BIT_TAR_10BIT_ADDR                       ((u32)0x00000001 << 12)                             /*!<R/W 1  This bit controls whether the I2C Module starts its transfers in 7-or 10-bit addressing mode when acting as a master. 0: 7-bit addressing 1: 10-bit addressing */
#define I2C_SHIFT_SPEC                               11
#define I2C_BIT_SPEC                                 ((u32)0x00000001 << 11)                             /*!<R/W 0  This bit indicates whether software performs a General Call or START BYTE command. 0: ignore bit 10 GC_OR_STARTand use TAR normally 1: perform special I2C command as specified in GC_OR_STARTbit */
#define I2C_SHIFT_GC_START_BYTE                      10
#define I2C_BIT_GC_START_BYTE                        ((u32)0x00000001 << 10)                             /*!<R/W 0  If bit 11 (SPECIAL) is set to 1, then this bit indicates whether a General Call or START byte command is to be performed by the I2C Module. 0: General Call Address - after issuing a General Call, only writes may be performed. Attempting to issue a read command results in setting bit 6 (TX_ABRT) of the RAW_INTR_STATregister. The I2C Module remains in General Call mode until the SPECIALbit value (bit 11) is cleared. 1: START BYTE */
#define I2C_SHIFT_TAR                                0
#define I2C_MASK_TAR                                 ((u32)0x000003FF << 0)                              /*!<R/W 0x55  This is the target address for any master transaction. When transmitting a General Call, these bits are ignored. To generate a START BYTE, the CPU needs to write only once into these bits.  */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SAR
 * @brief  I2C Slave Address Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SAR                                0
#define I2C_MASK_SAR                                 ((u32)0x000003FF << 0)                              /*!<R/W 0x55  The sar holds the slave address when the I2C is operating as a slave. For 7-bit addressing, only SAR[6:0] is used.This register can be written only when the I2C interface is disabled, which corresponds to the ENABLEregister being set to 0. Writes at other times have no effect. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_HS_MADDR
 * @brief  I2C High Speed Master Code Address Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_HS_MADDR                           0
#define I2C_MASK_HS_MADDR                            ((u32)0x00000007 << 0)                              /*!<R/W 1  This bit field holds the value of the I2C HS mode master code. HS-mode master codes are reserved 8-bit codes (00001xxx) that are not used for slave addressing or other purposes. Each master has its unique master code; up to eight highspeed mode masters can be present on the same I2C bus system. Valid values are from 0 to 7. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DAT_CMD
 * @brief  I2C Data Buffer and Command Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_NULL_DAT                           11
#define I2C_BIT_NULL_DAT                             ((u32)0x00000001 << 11)                             /*!<W 0  ([11:8] exist if DMA_MODE= 0) This bit controls whether to transfer slave address only. If it's set to 1, then hardware only sends a slave address to bus without data. 1: Send data only without sending slave address. 0: Normal operation. This bit will NOT influence any transfer sequence. */
#define I2C_SHIFT_RSTRT                              10
#define I2C_BIT_RSTRT                                ((u32)0x00000001 << 10)                             /*!<W 0  This bit controls whether a RESTART is issued before the byte is sent or received. 1 : If RESTART_EN is 1, a RESTART is issued before the data is sent/received (according to the value of CMD), regardless of whether or not the transfer direction is changing from the previous command; if RESTART_EN is 0, a STOP followed by a START is issued instead. 0 : If RESTART_EN is 1, a RESTART is issued only if the transfer direction is changing from the previous command; if RESTART_EN is 0, a STOP followed by a START is issued instead. */
#define I2C_SHIFT_STP                                9
#define I2C_BIT_STP                                  ((u32)0x00000001 << 9)                              /*!<W 0  This bit controls whether a STOP is issued after the byte is sent or received. 1 : STOP is issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master immediately tries to start a new transfer by issuing a START and arbitrating for the bus. 0 : STOP is not issued after this byte, regardless of whether or not the Tx FIFO is empty. If the Tx FIFO is not empty, the master continues the current transfer by sending/receiving data bytes according to the value of the CMD bit. If the Tx FIFO is empty, the master holds the SCL line low and stalls the bus until a new command is available in the Tx FIFO. */
#define I2C_SHIFT_CMD                                8
#define I2C_BIT_CMD                                  ((u32)0x00000001 << 8)                              /*!<W 0  This bit controls whether a read or a write is performed. This bit does not control the direction when the I2C Module acts as a slave. It controls only the direction when it acts as a master. 1 = Read 0 = Write */
#define I2C_SHIFT_DAT                                0
#define I2C_MASK_DAT                                 ((u32)0x000000FF << 0)                              /*!<R/W 0  This register contains the data to be transmitted or received on the I2C bus. If you are writing to this register and want to perform a read, bits 7:0 (DAT) are ignored by the I2C Module. However, when you read this register, these bits return the value of data received on the I2C Module interface. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SS_SCL_HCNT
 * @brief  Standard Speed I2C Clock SCL High Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_HCNT                               0
#define I2C_MASK_HCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x190  This register sets the SCL clock high-period count for standard speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SS_SCL_LCNT
 * @brief  Standard Speed I2C Clock SCL Low Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_LCNT                               0
#define I2C_MASK_LCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x1D6  This register sets the SCL clock low period count for standard speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_FS_SCL_HCNT
 * @brief  Fast Speed I2C Clock SCL High Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_HCNT                               0
#define I2C_MASK_HCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x3C  This register sets the SCL clock high-period count for fast speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_FS_SCL_LCNT
 * @brief  Fast Speed I2C Clock SCL Low Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_LCNT                               0
#define I2C_MASK_LCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x82  This register sets the SCL clock low period count for fast speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_HS_SCL_HCNT
 * @brief  High Speed I2C Clock SCL High Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_HCNT                               0
#define I2C_MASK_HCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x6  This register sets the SCL clock high period count for high speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_HS_SCL_LCNT
 * @brief  High Speed I2C Clock SCL Low Count Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_LCNT                               0
#define I2C_MASK_LCNT                                ((u32)0x0000FFFF << 0)                              /*!<R/W 0x10  This register sets the SCL clock low period count for high speed. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_INTR_STAT
 * @brief  I2C Interrupt Status Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_INTR_DMA_I2C_DONE                       15
#define I2C_BIT_INTR_DMA_I2C_DONE                         ((u32)0x00000001 << 15)                             /*!<R 0  (Active if DMA_MODE = 1) */
#define I2C_SHIFT_INTR_MS_CODE_DET                        14
#define I2C_BIT_INTR_MS_CODE_DET                          ((u32)0x00000001 << 14)                             /*!<R 0  (Active in HS mode) */
#define I2C_SHIFT_INTR_ADDR1_MATCH                        13
#define I2C_BIT_INTR_ADDR1_MATCH                          ((u32)0x00000001 << 13)                             /*!<R 0  (Active w/wo clock src) */
#define I2C_SHIFT_INTR_ADDR0_MATCH                        12
#define I2C_BIT_INTR_ADDR0_MATCH                          ((u32)0x00000001 << 12)                             /*!<R 0  (Active w/wo clock src) */
#define I2C_SHIFT_INTR_GEN_CALL                           11
#define I2C_BIT_INTR_GEN_CALL                             ((u32)0x00000001 << 11)                             /*!<R 0   */
#define I2C_SHIFT_INTR_STRT_DET                           10
#define I2C_BIT_INTR_STRT_DET                             ((u32)0x00000001 << 10)                             /*!<R 0   */
#define I2C_SHIFT_INTR_STP_DET                            9
#define I2C_BIT_INTR_STP_DET                              ((u32)0x00000001 << 9)                              /*!<R 0   */
#define I2C_SHIFT_INTR_ACT                                8
#define I2C_BIT_INTR_ACT                                  ((u32)0x00000001 << 8)                              /*!<R 0   */
#define I2C_SHIFT_INTR_RX_DONE                            7
#define I2C_BIT_INTR_RX_DONE                              ((u32)0x00000001 << 7)                              /*!<R 0   */
#define I2C_SHIFT_INTR_TX_ABRT                            6
#define I2C_BIT_INTR_TX_ABRT                              ((u32)0x00000001 << 6)                              /*!<R 0   */
#define I2C_SHIFT_INTR_RD_REQ                             5
#define I2C_BIT_INTR_RD_REQ                               ((u32)0x00000001 << 5)                              /*!<R 0   */
#define I2C_SHIFT_INTR_TX_EMPTY                           4
#define I2C_BIT_INTR_TX_EMPTY                             ((u32)0x00000001 << 4)                              /*!<R 0   */
#define I2C_SHIFT_INTR_TX_OVER                            3
#define I2C_BIT_INTR_TX_OVER                              ((u32)0x00000001 << 3)                              /*!<R 0   */
#define I2C_SHIFT_INTR_RX_FULL                            2
#define I2C_BIT_INTR_RX_FULL                              ((u32)0x00000001 << 2)                              /*!<R 0   */
#define I2C_SHIFT_INTR_RX_OVER                            1
#define I2C_BIT_INTR_RX_OVER                              ((u32)0x00000001 << 1)                              /*!<R 0   */
#define I2C_SHIFT_INTR_RX_UNDER                           0
#define I2C_BIT_INTR_RX_UNDER                             ((u32)0x00000001 << 0)                              /*!<R 0   */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_INTR_MSK
 * @brief  I2C Interrupt Mask Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_M_DMA_I2C_DONE                       15
#define I2C_BIT_M_DMA_I2C_DONE                         ((u32)0x00000001 << 15)                             /*!<R/W 1   */
#define I2C_SHIFT_M_MS_CODE_DET                        14
#define I2C_BIT_M_MS_CODE_DET                          ((u32)0x00000001 << 14)                             /*!<R/W 1   */
#define I2C_SHIFT_M_ADDR1_MATCH                        13
#define I2C_BIT_M_ADDR1_MATCH                          ((u32)0x00000001 << 13)                             /*!<R/W 1  (active only if SLAVE_DISABLE_1 is 0) */
#define I2C_SHIFT_M_ADDR0_MATCH                        12
#define I2C_BIT_M_ADDR0_MATCH                          ((u32)0x00000001 << 12)                             /*!<R/W 1   */
#define I2C_SHIFT_M_GEN_CALL                           11
#define I2C_BIT_M_GEN_CALL                             ((u32)0x00000001 << 11)                             /*!<R/W 1   */
#define I2C_SHIFT_M_STRT_DET                           10
#define I2C_BIT_M_STRT_DET                             ((u32)0x00000001 << 10)                             /*!<R/W 1   */
#define I2C_SHIFT_M_STP_DET                            9
#define I2C_BIT_M_STP_DET                              ((u32)0x00000001 << 9)                              /*!<R/W 1   */
#define I2C_SHIFT_M_ACT                                8
#define I2C_BIT_M_ACT                                  ((u32)0x00000001 << 8)                              /*!<R/W 1   */
#define I2C_SHIFT_M_RX_DONE                            7
#define I2C_BIT_M_RX_DONE                              ((u32)0x00000001 << 7)                              /*!<R/W 1   */
#define I2C_SHIFT_M_TX_ABRT                            6
#define I2C_BIT_M_TX_ABRT                              ((u32)0x00000001 << 6)                              /*!<R/W 1   */
#define I2C_SHIFT_M_RD_REQ                             5
#define I2C_BIT_M_RD_REQ                               ((u32)0x00000001 << 5)                              /*!<R/W 1   */
#define I2C_SHIFT_M_TX_EMPTY                           4
#define I2C_BIT_M_TX_EMPTY                             ((u32)0x00000001 << 4)                              /*!<R/W 1   */
#define I2C_SHIFT_M_TX_OVER                            3
#define I2C_BIT_M_TX_OVER                              ((u32)0x00000001 << 3)                              /*!<R/W 1   */
#define I2C_SHIFT_M_RX_FULL                            2
#define I2C_BIT_M_RX_FULL                              ((u32)0x00000001 << 2)                              /*!<R/W 1   */
#define I2C_SHIFT_M_RX_OVER                            1
#define I2C_BIT_M_RX_OVER                              ((u32)0x00000001 << 1)                              /*!<R/W 1   */
#define I2C_SHIFT_M_RX_UNDER                           0
#define I2C_BIT_M_RX_UNDER                             ((u32)0x00000001 << 0)                              /*!<R/W 1   */
/** @} */

