Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c_type.h
/**************************************************************************//**
 * @defgroup I2C_TYPE_RAW_INTR_STAT
 * @brief  I2C Raw Interrupt Status Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_RAW_DMA_I2C_DONE                       15
#define I2C_BIT_RAW_DMA_I2C_DONE                         ((u32)0x00000001 << 15)                             /*!<R 0  Indicates whether I2C DMA operation is done. */
#define I2C_SHIFT_RAW_MS_CODE_DET                        14
#define I2C_BIT_RAW_MS_CODE_DET                          ((u32)0x00000001 << 14)                             /*!<R 0  Indicates whether master code is detected. */
#define I2C_SHIFT_RAW_ADDR1_MATCH                        13
#define I2C_BIT_RAW_ADDR1_MATCH                          ((u32)0x00000001 << 13)                             /*!<R 0  Indicates whether an address matches with slave address 1 when acting as a slave. */
#define I2C_SHIFT_RAW_ADDR0_MATCH                        12
#define I2C_BIT_RAW_ADDR0_MATCH                          ((u32)0x00000001 << 12)                             /*!<R 0  Indicates whether an address matches with slave address 0 when acting as a slave. */
#define I2C_SHIFT_RAW_GEN_CALL                           11
#define I2C_BIT_RAW_GEN_CALL                             ((u32)0x00000001 << 11)                             /*!<R 0  Set only when a General Call address is received and it is acknowledged. It stays set until it is cleared either by disabling I2C Module or when the CPU reads bit 0 of the CLR_GEN_CALL register. The received data is stored in the Rx buffer. */
#define I2C_SHIFT_RAW_STRT_DET                           10
#define I2C_BIT_RAW_STRT_DET                             ((u32)0x00000001 << 10)                             /*!<R 0  Indicates whether a START or RESTART condition has occurred on the I2C interface regardless of whether I2C Module is operating in slave or master mode. */
#define I2C_SHIFT_RAW_STP_DET                            9
#define I2C_BIT_RAW_STP_DET                              ((u32)0x00000001 << 9)                              /*!<R 0  Indicates whether a STOP condition has occurred on the I2C interface regardless of whether I2C Module is operating in slave or master mode. */
#define I2C_SHIFT_RAW_ACT                                8
#define I2C_BIT_RAW_ACT                                  ((u32)0x00000001 << 8)                              /*!<R 0  This bit captures I2C Module activity and stays set until it is cleared. There are four ways to clear it: - Disabling the I2C Module - Reading the CLR_ACTIVITY register - Reading the CLR_INTR register - System reset Once this bit is set, it stays set unless one of the four methods is used to clear it. Even if the I2C Module module is idle, this bit remains set until cleared, indicating that there was activity on the bus. */
#define I2C_SHIFT_RAW_RX_DONE                            7
#define I2C_BIT_RAW_RX_DONE                              ((u32)0x00000001 << 7)                              /*!<R 0  When the I2C Module is acting as a slave-transmitter, this bit is set to 1 if the master does not acknowledge a transmitted byte. This occurs on the last byte of the transmission, indicating that the transmission is done. */
#define I2C_SHIFT_RAW_TX_ABRT                            6
#define I2C_BIT_RAW_TX_ABRT                              ((u32)0x00000001 << 6)                              /*!<R 0  This bit indicates if I2C Module, as an I2C transmitter, is unable to complete the intended actions on the contents of the transmit FIFO. This situation can occur both as an I2C master or an I2C slave, and is referred to as a Transmit Abort. When this bit is set to 1, the TX_ABRT_SOURCE register indicates the reason why the transmit abort takes places */
#define I2C_SHIFT_RAW_RD_REQ                             5
#define I2C_BIT_RAW_RD_REQ                               ((u32)0x00000001 << 5)                              /*!<R 0  This bit is set to 1 when I2C Module is acting as a slave and another I2C master is attempting to read data from I2C Module. The I2C Module holds the I2C bus in a wait state (SCL=0) until this interrupt is serviced, which means that the slave has been addressed by a remote master that is asking for data to be transferred. The processor must respond to this interrupt and then write the requested data to the DATA_CMD register. This bit is set to 0 just after the processor reads the CLR_RD_REQ register. */
#define I2C_SHIFT_RAW_TX_EMPTY                           4
#define I2C_BIT_RAW_TX_EMPTY                             ((u32)0x00000001 << 4)                              /*!<R 0  This bit is set to 1 when the transmit buffer is at or below the threshold value set in the TX_TL register. It is automatically cleared by hardware when the buffer level goes above the threshold. When the ENABLE bit 0 is 0, the TX FIFO is flushed and held in reset. There the TX FIFO looks like it has no data within it, so this bit is set to 1, provided there is activity in the master or slave state machines. When there is no longer activity, then with en=0, this bit is set to 0. */
#define I2C_SHIFT_RAW_TX_OVER                            3
#define I2C_BIT_RAW_TX_OVER                              ((u32)0x00000001 << 3)                              /*!<R 0  Set during transmit if the transmit buffer is filled to TX_BUFFER_DEPTH and the processor attempts to issue another I2C command by writing to the DATA_CMD register. When the module is disabled, this bit keeps its level until the master or slave state machines go into idle, and when en goes to 0, this interrupt is cleared. */
#define I2C_SHIFT_RAW_RX_FULL                            2
#define I2C_BIT_RAW_RX_FULL                              ((u32)0x00000001 << 2)                              /*!<R 0  Set when the receive buffer reaches or goes above the RX_TL threshold in the rx_tl register. It is automatically cleared by hardware when buffer level goes below the threshold. If the module is disabled (ENABLE[0]=0), the RX FIFO is flushed and held in reset; therefore the RX FIFO is not full. So this bit is cleared once the ENABLE bit 0 is programmed with a 0, regardless of the activity that continues. */
#define I2C_SHIFT_RAW_RX_OVER                            1
#define I2C_BIT_RAW_RX_OVER                              ((u32)0x00000001 << 1)                              /*!<R 0  Set if the receive buffer is completely filled to RX_BUFFER_DEPTH and an additional byte is received from an external I2C device. The I2C Module acknowledges this, but any data bytes received after the FIFO is full are lost. If the module is disabled (ENABLE[0]=0), this bit keeps its level until the master or slave state machines go into idle, and when en goes to 0, this interrupt is cleared. */
#define I2C_SHIFT_RAW_RX_UNDER                           0
#define I2C_BIT_RAW_RX_UNDER                             ((u32)0x00000001 << 0)                              /*!<R 0  Set if the processor attempts to read the receive buffer when it is empty by reading from the data_cmd register. If the module is disabled (ENABLE[0]=0), this bit keeps its level until the master or slave state machines go into idle, and when en goes to 0, this interrupt is cleared. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_RX_TL
 * @brief  I2C Receive FIFO Threshold Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_RX_TL                              0
#define I2C_MASK_RX_TL                               ((u32)0x000000FF << 0)                              /*!<R/W 0xB  Receive FIFO Threshold Level Controls the level of entries (or above) that triggers the RX_FULLinterrupt (bit 2 in RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that hardware does not allow this value to be set to a value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer.A value of 0 sets the threshold for 1 entry, and a value of 255 sets the threshold for 256 entries. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_TX_TL
 * @brief  I2C Transmit FIFO Threshold Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_TX_TL                              0
#define I2C_MASK_TX_TL                               ((u32)0x000000FF << 0)                              /*!<R/W 0x3  Transmit FIFO Threshold Level Controls the level of entries (or below) that trigger the TX_EMPTYinterrupt (bit 4 in RAW_INTR_STAT register). The valid range is 0-255, with the additional restriction that it may not be set to value larger than the depth of the buffer. If an attempt is made to do that, the actual value set will be the maximum depth of the buffer.A value of 0 sets the threshold for 0 entries, and a value of 255 sets the threshold for 255 entries. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_INTR
 * @brief  Clear Combined and Individual Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_INTR                           0
#define I2C_BIT_CLR_INTR                             ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the combined interrupt, all individual interrupts, and the TX_ABRT_SOURCE register. This bit does not clear hardware clearable interrupts but software clearable interrupts. Refer to Bit 9 of the TX_ABRT_SOURCE register for an exception to clearing TX_ABRT_SOURCE. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_RX_UNDER
 * @brief  Clear RX_UNDER Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_RX_UNDER                       0
#define I2C_BIT_CLR_RX_UNDER                         ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the rx_under interrupt (bit 0) of the raw_intr_stat register */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_RX_OVER
 * @brief  Clear RX_OVER Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_RX_OVER                        0
#define I2C_BIT_CLR_RX_OVER                          ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the rx_over interrupt (bit 1) of the raw_intr_stat register */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_TX_OVER
 * @brief  Clear TX_OVER Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_TX_OVER                        0
#define I2C_BIT_CLR_TX_OVER                          ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the tx_over interrupt (bit 3) of the raw_intr_stat register. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_RD_REQ
 * @brief  Clear RD_REQ Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_RD_REQ                         0
#define I2C_BIT_CLR_RD_REQ                           ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the rd_req interrupt (bit 5) of the raw_intr_stat register */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_TX_ABRT
 * @brief  Clear TX_ABRT Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_TX_ABRT                        0
#define I2C_BIT_CLR_TX_ABRT                          ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the tx_abrt interrupt (bit 6) of the raw_intr_stat register, and the tx_abrt_src register.This also releases the tx fifo from the flushed/reset state, allowing more writes to the TX FIFO. Refer to Bit 9 of the tx_abrt_src register for an exception to clearing tx_abrt_src. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_RX_DONE
 * @brief  Clear RX_DONE Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_RX_DONE                        0
#define I2C_BIT_CLR_RX_DONE                          ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the rx_done interrupt (bit 7) of the raw_intr_stat register */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_ACT
 * @brief  Clear ACTIVITY Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_ACT                            0
#define I2C_BIT_CLR_ACT                              ((u32)0x00000001 << 0)                              /*!<R 0  Reading this register clears the activity interrupt if the I2C is not active anymore. If the I2C module is still active on the bus, the activity interrupt bit continues to be set. It is automatically cleared by hardware if the module is disabled and if there is no further activity on the bus. The value read from this register to get status of the activity interrupt (bit 8) of the raw_intr_stat register. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_STP_DET
 * @brief  Clear STOP_DET Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_STP_DET                        0
#define I2C_BIT_CLR_STP_DET                          ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the stop_det interrupt (bit 9) of the raw_intr_stat register. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_STRT_DET
 * @brief  Clear START_DET Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_STRT_DET                       0
#define I2C_BIT_CLR_STRT_DET                         ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the start_det interrupt (bit 10) of the raw_intr_stat register. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_GEN_CALL
 * @brief  Clear GEN_CALL Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_GEN_CALL                       0
#define I2C_BIT_CLR_GEN_CALL                         ((u32)0x00000001 << 0)                              /*!<R 0  Read this register to clear the gen_call interrupt (bit 11) of raw_intr_stat register */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_ENABLE
 * @brief  I2C Enable Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_ABRT                               1
#define I2C_BIT_ABRT                                 ((u32)0x00000001 << 1)                              /*!<R/W 0  Abort I2C current transfer is done w/o flush Tx/Rx FIFO */
#define I2C_SHIFT_EN                                 0
#define I2C_BIT_EN                                   ((u32)0x00000001 << 0)                              /*!<R/W 0  Controls whether the I2C Module is enabled. 0: Disables I2C Module (TX and RX FIFOs are held in an erased state) 1: Enables I2C Module */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_STS
 * @brief  I2C Status Reigster
 * @{
 *****************************************************************************/
#define I2C_SHIFT_STS_BUS_STS                            11
#define I2C_MASK_STS_BUS_STS                             ((u32)0x00000003 << 11)                             /*!<R/W 0  Show current I2C bus status 00 indicates I2C bus is in idle 01: I2C bus is in address phase 10: I2C bus is in data phase 11: I2C bus is in clock stretch phase */
#define I2C_SHIFT_STS_SLV_HOLD_RX_FULL                   10
#define I2C_BIT_STS_SLV_HOLD_RX_FULL                     ((u32)0x00000001 << 10)                             /*!<R 0  1: I2C module is holding I2C bus low (clock stretch) because of RX FIFO full in slave mode. */
#define I2C_SHIFT_STS_SLV_HOLD_TX_EMPTY                  9
#define I2C_BIT_STS_SLV_HOLD_TX_EMPTY                    ((u32)0x00000001 << 9)                              /*!<R 0  1: I2C module is holding I2C bus low (clock stretch) because of TX FIFO empty in slave mode. */
#define I2C_SHIFT_STS_MST_HOLD_RX_FULL                   8
#define I2C_BIT_STS_MST_HOLD_RX_FULL                     ((u32)0x00000001 << 8)                              /*!<R 0  1: I2C module is holding I2C bus low (clock stretch) because of RX FIFO full in master mode. */
#define I2C_SHIFT_STS_MST_HOLD_TX_EMPTY                  7
#define I2C_BIT_STS_MST_HOLD_TX_EMPTY                    ((u32)0x00000001 << 7)                              /*!<R 0  1: I2C module is holding I2C bus low (clock stretch) because of TX FIFO empty in master mode. */
#define I2C_SHIFT_STS_SLV_ACT                            6
#define I2C_BIT_STS_SLV_ACT                              ((u32)0x00000001 << 6)                              /*!<R 0  Slave FSM Activity Status. When the Slave Finite State Machine (FSM) is not in the IDLE state, this bit is set. 0: Slave FSM is in IDLE state so the Slave part of I2C Module is not Active 1: Slave FSM is not in IDLE state so the Slave part of I2C Module is Active */
#define I2C_SHIFT_STS_MST_ACT                            5
#define I2C_BIT_STS_MST_ACT                              ((u32)0x00000001 << 5)                              /*!<R 0  Master FSM Activity Status. When the Master Finite State Machine (FSM) is not in the IDLE state, this bit is set. 0: Master FSM is in IDLE state so the Master part of I2C Module is not Active 1: Master FSM is not in IDLE state so the Master part of I2C Module is Active */
#define I2C_SHIFT_STS_RFF                                4
#define I2C_BIT_STS_RFF                                  ((u32)0x00000001 << 4)                              /*!<R 0  Receive FIFO CompletelyFull. When the receive FIFO iscompletely full, this bit is set. When the receive FIFO contains one or more empty location, this bit is cleared. 0: Receive FIFO is not full 1: Receive FIFO is full */
#define I2C_SHIFT_STS_RFNE                               3
#define I2C_BIT_STS_RFNE                                 ((u32)0x00000001 << 3)                              /*!<R 0  Receive FIFO Not Empty. This bit is set when the receive FIFO contains one or more entries; it is cleared when the receive FIFO is empty. 0: Receive FIFO is empty 1: Receive FIFO is not empty */
#define I2C_SHIFT_STS_TFE                                2
#define I2C_BIT_STS_TFE                                  ((u32)0x00000001 << 2)                              /*!<R 1  Transmit FIFO Completely Empty. When the transmit FIFO is completely empty, this bit is set. When it contains one or morevalid entries, this bit is cleared. This bit field does not request an interrupt. 0: Transmit FIFO is not empty 1: Transmit FIFO is empty */
#define I2C_SHIFT_STS_TFNF                               1
#define I2C_BIT_STS_TFNF                                 ((u32)0x00000001 << 1)                              /*!<R 1  Transmit FIFO Not Full. Set when the transmit FIFO contains one or more empty locations, and is cleared when the FIFO is full. 0: Transmit FIFO is full 1: Transmit FIFO is not full */
#define I2C_SHIFT_STS_ACT                                0
#define I2C_BIT_STS_ACT                                  ((u32)0x00000001 << 0)                              /*!<R 0  I2C Activity Status. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_TXFLR
 * @brief  I2C Transmit FIFO Level Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_TXFLR                              0
#define I2C_MASK_TXFLR                               ((u32)0x0000001F << 0)                              /*!<R 0  Transmit FIFO Level. Contains the number of valid data entries in the transmit FIFO. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_RXFLR
 * @brief  I2C Receive FIFO Level Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_RXFLR                              0
#define I2C_MASK_RXFLR                               ((u32)0x0000001F << 0)                              /*!<R 0  Receive FIFO Level. Contains the number of valid data entries in the receive FIFO. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SDA_HOLD
 * @brief  I2C SDA Hold Time Length Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SDA_HOLD                           0
#define I2C_MASK_SDA_HOLD                            ((u32)0x0000FFFF << 0)                              /*!<R/W 1  Sets the required SDA hold timein units of clk period. */
/** @} */

