Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c_type.h
/**************************************************************************//**
 * @defgroup I2C_TYPE_TX_ABRT_SRC
 * @brief  I2C Transmit Abort Source Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SLVRD_INTX                         15
#define I2C_BIT_SLVRD_INTX                           ((u32)0x00000001 << 15)                             /*!<R 0  1: When the processor side responds to a slave mode request for data to be transmitted to a remote master and user writes a 1 in cmd(bit 8) of dat_cmd register. */
#define I2C_SHIFT_SLV_ARBLOST                        14
#define I2C_BIT_SLV_ARBLOST                          ((u32)0x00000001 << 14)                             /*!<R 0  1: Slave lost the bus while transmitting data to a remote master. Tx_abrt_src[12] is set at the same time. */
#define I2C_SHIFT_SLVFLUSH_TXFIFO                    13
#define I2C_BIT_SLVFLUSH_TXFIFO                      ((u32)0x00000001 << 13)                             /*!<R 0  1: Slave has received a read command and some data exists in the TX FIFO so the slave issues a tx_abrt interrupt to flush old data in TX FIFO. */
#define I2C_SHIFT_ARB_LOST                           12
#define I2C_BIT_ARB_LOST                             ((u32)0x00000001 << 12)                             /*!<R 0  1: Master has lost arbitration, or if tx_abrt_src[14] is also set, then the slave transmitter has lost arbitration. */
#define I2C_SHIFT_MST_DIS                            11
#define I2C_BIT_MST_DIS                              ((u32)0x00000001 << 11)                             /*!<R 0  1: User tries to initiate a Master operation with the Master mode disabled. */
#define I2C_SHIFT_NORSTRT_10BIT_RD                   10
#define I2C_BIT_NORSTRT_10BIT_RD                     ((u32)0x00000001 << 10)                             /*!<R 0  1: The restart is disabled (rstrt_en bit (con[5]) = 0) and the master sends a read command in 10-bit addressing mode. */
#define I2C_SHIFT_NORSTRT_SBYTE                      9
#define I2C_BIT_NORSTRT_SBYTE                        ((u32)0x00000001 << 9)                              /*!<R 0  1: The restart is disabled (rstrt_en bit con[5]) = 0) and the user is trying to send a START Byte. */
#define I2C_SHIFT_NORSTRT_HS                         8
#define I2C_BIT_NORSTRT_HS                           ((u32)0x00000001 << 8)                              /*!<R 0  1: The restart is disabled (rstrt_en bit (con[5]) = 0) and the user is trying to use the master to transfer data in High Speed mode. */
#define I2C_SHIFT_SBYTE_ACKDET                       7
#define I2C_BIT_SBYTE_ACKDET                         ((u32)0x00000001 << 7)                              /*!<R 0  1: Master has sent a START Byte and the START Byte was acknowledged (wrong behavior). */
#define I2C_SHIFT_HS_ACKDET                          6
#define I2C_BIT_HS_ACKDET                            ((u32)0x00000001 << 6)                              /*!<R 0  1: Master is in High Speed mode and the High Speed Master code was acknowledged (wrong behavior). */
#define I2C_SHIFT_GCALL_RD                           5
#define I2C_BIT_GCALL_RD                             ((u32)0x00000001 << 5)                              /*!<R 0  1: I2C Module in master mode sent a General Call but the user programmed the byte following the General Call to be a read from the bus (dat_cmd[9] is set to 1). */
#define I2C_SHIFT_GCALL_NACK                         4
#define I2C_BIT_GCALL_NACK                           ((u32)0x00000001 << 4)                              /*!<R 0  1: I2C Module in master mode sent a General Call and no slave on the bus acknowledged the General Call. */
#define I2C_SHIFT_TXDAT_NACK                         3
#define I2C_BIT_TXDAT_NACK                           ((u32)0x00000001 << 3)                              /*!<R 0  1: This is a master-mode only bit. Master has received an acknowledgement for the address, but when it sent data byte(s) following the address, it did not receive an acknowledge from the remote slave(s). */
#define I2C_SHIFT_ADDR2_10BIT_NACK                   2
#define I2C_BIT_ADDR2_10BIT_NACK                     ((u32)0x00000001 << 2)                              /*!<R 0  1: Master is in 10-bit address mode and the second address byte of the 10-bit address was not acknowledged by any slave. */
#define I2C_SHIFT_ADDR1_10BIT_NACK                   1
#define I2C_BIT_ADDR1_10BIT_NACK                     ((u32)0x00000001 << 1)                              /*!<R 0  1: Master is in 10-bit address mode and the first 10-bit address byte was not acknowledged by any slave. */
#define I2C_SHIFT_ADDR_7BIT_NACK                     0
#define I2C_BIT_ADDR_7BIT_NACK                       ((u32)0x00000001 << 0)                              /*!<R 0  1: Master is in 7-bit addressing mode and the address sent was not acknowledged by any slave. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SLV_DAT_NACK
 * @brief  I2C Generate Slave Data NACK Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SLV_DAT_NACK                       0
#define I2C_BIT_SLV_DAT_NACK                         ((u32)0x00000001 << 0)                              /*!<R/W 0  Generate NACK. This NACK generation only occurs when I2C Module is a slavereceiver. If this register is set to a value of 1, it can only generate a NACK after a data byte is received; hence, the data transfer is aborted and the data received is not pushed to the receive buffer. When the register is set to a value of 0, it generates NACK/ACK, depending on normal criteria. 1 = generate NACK after data byte received 0 = generate NACK/ACK normally */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_CR
 * @brief  I2C DMA Control Reigster
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_TDMAE                              1
#define I2C_BIT_DMA_TDMAE                                ((u32)0x00000001 << 1)                              /*!<R/W 0  Transmit DMA Enable. This bit enables/disables the transmit FIFO DMA channel. 0 = Transmit DMA disabled 1 = Transmit DMA enabled */
#define I2C_SHIFT_DMA_RDMAE                              0
#define I2C_BIT_DMA_RDMAE                                ((u32)0x00000001 << 0)                              /*!<R/W 0  Receive DMA Enable. This bit enables/disables the receive FIFO DMA channel. 0 = Receive DMA disabled 1 = Receive DMA enabled  */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_TDLR
 * @brief  I2C DMA Transmit Data Level Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_TDLR                               0
#define I2C_MASK_DMA_TDLR                                ((u32)0x0000000F << 0)                              /*!<R/W 0  Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and tdmae= 1. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_RDLR
 * @brief  I2C DMA Receive Data Level Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_RDLR                               0
#define I2C_MASK_DMA_RDLR                                ((u32)0x0000000F << 0)                              /*!<R/W 0  Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or more than this field value + 1, and RDMAE =1. For instance, when DMARDLis 0, then dma_rx_req is asserted when 1 or more data entries are present in the receive FIFO. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SDA_SETUP
 * @brief  I2C SDA Setup Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SDA_SETUP                          0
#define I2C_MASK_SDA_SETUP                           ((u32)0x000000FF << 0)                              /*!<R/W 0x38  SDA Setup. It is recommended that if the required delay is 1000ns, then for an clk frequency of 10 MHz, SDA_SETUP should be programmed to a value of 11. SDA_SETUP must be programmed with a minimum value of 2. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_ACK_GEN_CALL
 * @brief  I2C ACK General Call Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_ACK_GEN_CALL                       0
#define I2C_BIT_ACK_GEN_CALL                         ((u32)0x00000001 << 0)                              /*!<R/W 1  ACK General Call. When set to 1, I2C Module responds with a ACK (by asserting data_oe) when it receives a General Call. When set to 0, the I2C Module does not generate General Call interrupts. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_EN_STS
 * @brief  I2C Enable Status Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_DIS_STS                        3
#define I2C_MASK_DMA_DIS_STS                         ((u32)0x00000003 << 3)                              /*!<R 0  DMA_DISABLE_WHILE_BUSY. 00: No ill disable event is active 01: I2C is disable while busy in legacy mode 10: I2C is disable while busy in DMA mode 11: I2C is disable while busy in Descriptor mode */
#define I2C_SHIFT_SLV_RX_DAT_LOST                    2
#define I2C_BIT_SLV_RX_DAT_LOST                      ((u32)0x00000001 << 2)                              /*!<R 0  Slave Received Data Lost. This bit indicates if a Slave-Receiver operation has been aborted with at least one data byte received from an I2C transfer due to the setting of enable from 1 to 0. */
#define I2C_SHIFT_SLV_DIS_IN_BUSY                    1
#define I2C_BIT_SLV_DIS_IN_BUSY                      ((u32)0x00000001 << 1)                              /*!<R 0  Slave Disabled While Busy (Transmit, Receive). This bit indicates if a potential or active Slave operation has been aborted due to the setting of the ENABLE register from 1 to 0. */
#define I2C_SHIFT_EN_STS                                 0
#define I2C_BIT_EN_STS                                   ((u32)0x00000001 << 0)                              /*!<R 0  Enable Status. This bit always reflects the value driven on the output port en. When read as 1, I2C Module is deemed to be in an enabled state. When read as 0, I2C Module is deemed completely inactive. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_CMD
 * @brief  I2C DMA Command Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_RSTRT                              7
#define I2C_BIT_DMA_RSTRT                                ((u32)0x00000001 << 7)                              /*!<R/W 0  This bit controls whether a RESTART is issued before the byte is sent or received when DMA mode is enabled. */
#define I2C_SHIFT_DMA_STP                                6
#define I2C_BIT_DMA_STP                                  ((u32)0x00000001 << 6)                              /*!<R/W 0  This bit controls whether a STOP is issued after the byte is sent or received.  */
#define I2C_SHIFT_DMA_CMD                                5
#define I2C_BIT_DMA_CMD                                  ((u32)0x00000001 << 5)                              /*!<R/W 0  This bit controls whether a read or a write is performed. This bit does not control the direction when the I2C Module acts as a slave. It controls only the direction when it acts as a master. 1 = Read 0 = Write */
#define I2C_SHIFT_DMA_EN                                 0
#define I2C_BIT_DMA_EN                                   ((u32)0x00000001 << 0)                              /*!<R/W 0  Set to enable DMA mode. Clear when transfer is done. */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_LEN
 * @brief  I2C DMA Transfer Data Length Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_TR_LEN                             16
#define I2C_MASK_DMA_TR_LEN                              ((u32)0x0000FFFF << 16)                             /*!<R 0  DMA mode transfer bytes(Read only) */
#define I2C_SHIFT_DMA_LEN                                0
#define I2C_MASK_DMA_LEN                                 ((u32)0x0000FFFF << 0)                              /*!<R/W 0  DMA transfer data length(R/W) */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DMA_MOD
 * @brief  I2C DMA Mode Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DMA_MOD                            0
#define I2C_MASK_DMA_MOD                             ((u32)0x00000003 << 0)                              /*!<R/W 0  DMA operation mode 0 is for legacy mode 1 is for DMA with control register 2 is for DMA with transfer descriptor */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SLP
 * @brief  I2C Sleep Control Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SLP_CLK_GATED                      1
#define I2C_BIT_SLP_CLK_GATED                        ((u32)0x00000001 << 1)                              /*!<R 0  I2C clock has been gated (Read Only) */
#define I2C_SHIFT_CLK_CTRL                           0
#define I2C_BIT_CLK_CTRL                             ((u32)0x00000001 << 0)                              /*!<R/W 0  I2C clock control, write 1 controller would gate I2C clock until I2C slave is enable and reset synchronized register procedure is done */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DAT_FLTR_RSTS_L
 * @brief  Data Filter Resistor Low Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DAT_FLTR_RSTS_L                    0
#define I2C_MASK_DAT_FLTR_RSTS_L                     ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Data Filter Resistor Low */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DAT_FLTR_RSTS_M
 * @brief  Data Filter Resistor Main Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DAT_FLTR_RSTS_M                    0
#define I2C_MASK_DAT_FLTR_RSTS_M                     ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Data Filter Resistor Main */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLK_FLTR_RSTS_L
 * @brief  Clock Filter Resistor Low Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLK_FLTR_RSTS_L                    0
#define I2C_MASK_CLK_FLTR_RSTS_L                     ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Clock Filter Resistor Low */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLK_FLTR_RSTS_M
 * @brief  Clock Filter Resistor Main Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLK_FLTR_RSTS_M                    0
#define I2C_MASK_CLK_FLTR_RSTS_M                     ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Clock Filter Resistor Main */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DAT_FLTR_CAP_L
 * @brief  Data Filter Capacitor Low Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DAT_FLTR_CAP_L                     0
#define I2C_MASK_DAT_FLTR_CAP_L                      ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Data Filter Capacitor Low */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_DAT_FLTR_CAP_M
 * @brief  Data Filter Capacitor Main Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DAT_FLTR_CAP_M                     0
#define I2C_MASK_DAT_FLTR_CAP_M                      ((u32)0x0000001F << 0)                              /*!<R/W 0  Data Filter Capacitor Main */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLK_FLTR_CAP_L
 * @brief  Clock Filter Capacitor Low Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLK_FLTR_CAP_L                     0
#define I2C_MASK_CLK_FLTR_CAP_L                      ((u32)0x000FFFFF << 0)                              /*!<R/W 0  Clock Filter Capacitor Low */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLK_FLTR_CAP_M
 * @brief  Clock Filter Capacitor Main Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLK_FLTR_CAP_M                     0
#define I2C_MASK_CLK_FLTR_CAP_M                      ((u32)0x0000001F << 0)                              /*!<R/W 0  Clock Filter Capacitor Main */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_ADDR_MATCH
 * @brief  Clear I2C ADDR_MATCH Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_ADDR_MATCH                     0
#define I2C_BIT_CLR_ADDR_MATCH                       ((u32)0x00000001 << 0)                              /*!<R/W 0  Address match interrupts raw status, and read clear. ADDR_MATCH_* raw status clear 0:addr_match_raw */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_CLR_DMA_DONE
 * @brief  Clear I2C DMA_DONE Interrupt Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_CLR_DMA_DONE                       0
#define I2C_BIT_CLR_DMA_DONE                         ((u32)0x00000001 << 0)                              /*!<R/W 0  dma_i2c_done_intr interrupts raw status, and read clear 0: rx_packet_miss_raw */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_FLTR
 * @brief  I2C Bus Filter Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_DIG_FLTR_EN                        8
#define I2C_BIT_DIG_FLTR_EN                          ((u32)0x00000001 << 8)                              /*!<R/W 0  I2C module digital filter slection (enable) */
#define I2C_SHIFT_DIG_FLTR_DEG                       0
#define I2C_MASK_DIG_FLTR_DEG                        ((u32)0x0000000F << 0)                              /*!<R/W 0  I2C module digital filter degree */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_SAR1
 * @brief  I2C Slave Address 1 Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_SAR1                               0
#define I2C_MASK_SAR1                                ((u32)0x0000007F << 0)                              /*!<R/W 0x12  I2C Second Slave Address */
/** @} */

/**************************************************************************//**
 * @defgroup I2C_TYPE_VER
 * @brief  I2C Component Version Register
 * @{
 *****************************************************************************/
#define I2C_SHIFT_VER                                0
#define I2C_MASK_VER                                 ((u32)0xFFFFFFFF << 0)                              /*!<R 0x5245414C  I2C module version number (0x5245414C) */
/** @} */

