Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_i2c_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_I2C_TYPE
 * @{
 * @brief rtl8735b_I2C_TYPE Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t I2C_CON ;                                /*!<  I2C Control Register register,  Address offset: 0x000 */
	__IO uint32_t I2C_TAR ;                                /*!<  I2C Target Address Register register,  Address offset: 0x004 */
	__IO uint32_t I2C_SAR  ;                               /*!<  I2C Slave Address Register register,  Address offset: 0x008 */
	__IO uint32_t I2C_HS_MADDR ;                           /*!<  I2C High Speed Master Code Address Register register,  Address offset: 0x00C */
	__IO uint32_t I2C_DAT_CMD ;                            /*!<  I2C Data Buffer and Command Register register,  Address offset: 0x010 */
	__IO uint32_t I2C_SS_SCL_HCNT ;                        /*!<  Standard Speed I2C Clock SCL High Count Register register,  Address offset: 0x014 */
	__IO uint32_t I2C_SS_SCL_LCNT ;                        /*!<  Standard Speed I2C Clock SCL Low Count Register register,  Address offset: 0x018 */
	__IO uint32_t I2C_FS_SCL_HCNT ;                        /*!<  Fast Speed I2C Clock SCL High Count Register register,  Address offset: 0x01C */
	__IO uint32_t I2C_FS_SCL_LCNT ;                        /*!<  Fast Speed I2C Clock SCL Low Count Register register,  Address offset: 0x020 */
	__IO uint32_t I2C_HS_SCL_HCNT ;                        /*!<  High Speed I2C Clock SCL High Count Register register,  Address offset: 0x024 */
	__IO uint32_t I2C_HS_SCL_LCNT ;                        /*!<  High Speed I2C Clock SCL Low Count Register register,  Address offset: 0x028 */
	__I  uint32_t I2C_INTR_STAT ;                          /*!<  I2C Interrupt Status Register register,  Address offset: 0x02C */
	__IO uint32_t I2C_INTR_MSK ;                           /*!<  I2C Interrupt Mask Register register,  Address offset: 0x030 */
	__I  uint32_t I2C_RAW_INTR_STAT ;                      /*!<  I2C Raw Interrupt Status Register register,  Address offset: 0x034 */
	__IO uint32_t I2C_RX_TL ;                              /*!<  I2C Receive FIFO Threshold Register register,  Address offset: 0x038 */
	__IO uint32_t I2C_TX_TL ;                              /*!<  I2C Transmit FIFO Threshold Register register,  Address offset: 0x03C */
	__IO uint32_t I2C_CLR_INTR ;                           /*!<  Clear Combined and Individual Interrupt Register register,  Address offset: 0x040 */
	__IO uint32_t I2C_CLR_RX_UNDER ;                       /*!<  Clear RX_UNDER Interrupt Register register,  Address offset: 0x044 */
	__IO uint32_t I2C_CLR_RX_OVER ;                        /*!<  Clear RX_OVER Interrupt Register register,  Address offset: 0x048 */
	__IO uint32_t I2C_CLR_TX_OVER ;                        /*!<  Clear TX_OVER Interrupt Register register,  Address offset: 0x04C */
	__IO uint32_t I2C_CLR_RD_REQ ;                         /*!<  Clear RD_REQ Interrupt Register register,  Address offset: 0x050 */
	__IO uint32_t I2C_CLR_TX_ABRT ;                        /*!<  Clear TX_ABRT Interrupt Register register,  Address offset: 0x054 */
	__IO uint32_t I2C_CLR_RX_DONE ;                        /*!<  Clear RX_DONE Interrupt Register register,  Address offset: 0x058 */
	__IO uint32_t I2C_CLR_ACT ;                            /*!<  Clear ACTIVITY Interrupt Register register,  Address offset: 0x05C */
	__IO uint32_t I2C_CLR_STP_DET ;                        /*!<  Clear STOP_DET Interrupt Register register,  Address offset: 0x060 */
	__IO uint32_t I2C_CLR_STRT_DET ;                       /*!<  Clear START_DET Interrupt Register register,  Address offset: 0x064 */
	__IO uint32_t I2C_CLR_GEN_CALL ;                       /*!<  Clear GEN_CALL Interrupt Register register,  Address offset: 0x068 */
	__IO uint32_t I2C_ENABLE ;                             /*!<  I2C Enable Register register,  Address offset: 0x06C */
	__IO uint32_t I2C_STS ;                                /*!<  I2C Status Reigster register,  Address offset: 0x070 */
	__I  uint32_t I2C_TXFLR ;                              /*!<  I2C Transmit FIFO Level Register register,  Address offset: 0x074 */
	__I  uint32_t I2C_RXFLR ;                              /*!<  I2C Receive FIFO Level Register register,  Address offset: 0x078 */
	__IO uint32_t I2C_SDA_HOLD ;                           /*!<  I2C SDA Hold Time Length Register register,  Address offset: 0x07C */
	__IO uint32_t I2C_TX_ABRT_SRC ;                        /*!<  I2C Transmit Abort Source Register register,  Address offset: 0x080 */
	__IO uint32_t I2C_SLV_DAT_NACK ;                       /*!<  I2C Generate Slave Data NACK Register register,  Address offset: 0x084 */
	__IO uint32_t I2C_DMA_CR ;                             /*!<  I2C DMA Control Reigster register,  Address offset: 0x088 */
	__IO uint32_t I2C_DMA_TDLR ;                           /*!<  I2C DMA Transmit Data Level Register register,  Address offset: 0x08C */
	__IO uint32_t I2C_DMA_RDLR ;                           /*!<  I2C DMA Receive Data Level Register register,  Address offset: 0x090 */
	__IO uint32_t I2C_SDA_SETUP ;                          /*!<  I2C SDA Setup Register register,  Address offset: 0x094 */
	__IO uint32_t I2C_ACK_GEN_CALL ;                       /*!<  I2C ACK General Call Register register,  Address offset: 0x098 */
	__IO uint32_t I2C_EN_STS ;                             /*!<  I2C Enable Status Register register,  Address offset: 0x09C */
	__IO uint32_t I2C_DMA_CMD ;                            /*!<  I2C DMA Command Register register,  Address offset: 0x0A0 */
	__IO uint32_t I2C_DMA_LEN ;                            /*!<  I2C DMA Transfer Data Length Register register,  Address offset: 0x0A4 */
	__IO uint32_t I2C_DMA_MOD ;                            /*!<  I2C DMA Mode Register register,  Address offset: 0x0A8 */
	__IO uint32_t I2C_SLP ;                                /*!<  I2C Sleep Control Register register,  Address offset: 0x0AC */
	__IO uint32_t RSVD0[2];                                /*!<  Reserved,  Address offset:0xB0-0xB4 */
	__IO uint32_t I2C_DAT_FLTR_RSTS_L ;                    /*!<  Data Filter Resistor Low Register register,  Address offset: 0x0B8 */
	__IO uint32_t I2C_DAT_FLTR_RSTS_M ;                    /*!<  Data Filter Resistor Main Register register,  Address offset: 0x0BC */
	__IO uint32_t I2C_CLK_FLTR_RSTS_L ;                    /*!<  Clock Filter Resistor Low Register register,  Address offset: 0x0C0 */
	__IO uint32_t I2C_CLK_FLTR_RSTS_M ;                    /*!<  Clock Filter Resistor Main Register register,  Address offset: 0x0C4 */
	__IO uint32_t I2C_DAT_FLTR_CAP_L ;                     /*!<  Data Filter Capacitor Low Register register,  Address offset: 0x0C8 */
	__IO uint32_t I2C_DAT_FLTR_CAP_M ;                     /*!<  Data Filter Capacitor Main Register register,  Address offset: 0x0CC */
	__IO uint32_t I2C_CLK_FLTR_CAP_L ;                     /*!<  Clock Filter Capacitor Low Register register,  Address offset: 0x0D0 */
	__IO uint32_t I2C_CLK_FLTR_CAP_M ;                     /*!<  Clock Filter Capacitor Main Register register,  Address offset: 0x0D4 */
	__IO uint32_t RSVD1[3];                                /*!<  Reserved,  Address offset:0xD8-0xE0 */
	__IO uint32_t I2C_CLR_ADDR_MATCH ;                     /*!<  Clear I2C ADDR_MATCH Interrupt Register register,  Address offset: 0x0E4 */
	__IO uint32_t I2C_CLR_DMA_DONE ;                       /*!<  Clear I2C DMA_DONE Interrupt Register register,  Address offset: 0x0E8 */
	__IO uint32_t I2C_FLTR ;                               /*!<  I2C Bus Filter Register register,  Address offset: 0x0EC */
	__IO uint32_t RSVD2;                                  /*!<  Reserved,  Address offset:0xF0 */
	__IO uint32_t I2C_SAR1 ;                               /*!<  I2C Slave Address 1 Register register,  Address offset: 0x0F4 */
	__IO uint32_t RSVD3;                                  /*!<  Reserved,  Address offset:0xF8 */
	__I  uint32_t I2C_VER ;                                /*!<  I2C Component Version Register register,            Address offset: 0x0FC */
} I2C_TypeDef;
/** @} */

#ifdef  __cplusplus
}
#endif

#endif    // end of #ifndef _RTL8735B_I2C_TYPE_H_

